In [3]:
import os
os.getcwd()

'C:\\Users\\Administrator\\Documents'

In [4]:
import pandas as pd
df=pd.read_csv("final_data.csv")

In [8]:
pd.set_option('display.max_columns', None)  # Show all 
df

,trans_date_trans_time,cc_num,merchant,category,amt,first,last,gender,street,city,state,zip,lat,long,city_pop,job,dob,trans_num,unix_time,merch_lat,merch_long,is_fraud
0,2019-08-11 19:38:33,4681601008538160,fraud_Hermann and Sons,shopping_pos,50.81,Tammy,Davis,F,77663 Colleen Freeway,Moundsville,WV,26041,39.9148,-80.7310,16183,Physiotherapist,1977-08-12,f64003a5726ca99519ef2ad18bce32f5,1344713913,39.238053,-81.728984,0
1,2020-02-21 13:31:42,4653879239169997,"fraud_Cronin, Kshlerin and Weber",health_fitness,1.97,Monica,Tucker,F,302 Christina Islands,Smiths Grove,KY,42171,37.0581,-86.1938,6841,"Therapist, sports",1999-06-06,f8e25094098b22a8e9dce2670ffe891e,1361453502,36.665575,-85.608885,0
2,2019-09-03 02:39:49,4334230547694630,fraud_Rutherford-Mertz,grocery_pos,100.18,Scott,Martin,M,7483 Navarro Flats,Freedom,WY,83120,43.0172,-111.0292,471,"Education officer, museum",1967-08-02,291160a410748e5bec42d95ae06132ae,1346639989,43.362578,-110.580382,0
3,2020-03-31 02:39:04,2256234701263057,fraud_Kris-Padberg,shopping_pos,7.67,Christopher,Grimes,M,39631 Dunn Radial,Grantham,NH,3753,43.5103,-72.1334,2971,Charity fundraiser,1948-04-11,df716fe9ce97522bc074d8c93e6e18c2,1364697544,44.312773,-71.555079,0
4,2020-12-05 07:58:57,6011948324228984,"fraud_Towne, Greenholt and Koepp",shopping_net,478.10,Mckenzie,Brooks,F,3872 Matthew Skyway,Paris,MS,38949,34.1992,-89.3820,297,"Administrator, local government",1961-12-14,c33bcd8c63d50b4fe9c2514c7107e1ba,1386230337,34.362314,-89.623306,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19297,2020-12-22 22:05:48,2242176657877538,"fraud_Willms, Kris and Bergnaum",shopping_pos,1041.51,Travis,Daniel,M,1327 Rose Causeway Apt. 610,Senatobia,MS,38668,34.6323,-89.8855,14462,Database administrator,1959-03-03,35b0297dd026d2e9a75d024a5dec7955,1387749948,34.573471,-89.911011,1
19298,2020-12-22 22:18:07,2242176657877538,fraud_Kuhn LLC,shopping_pos,868.09,Travis,Daniel,M,1327 Rose Causeway Apt. 610,Senatobia,MS,38668,34.6323,-89.8855,14462,Database administrator,1959-03-03,da7f67d7375f10a054a3d919448c45dd,1387750687,34.091227,-90.390612,1
19299,2020-12-22 22:31:48,2242176657877538,"fraud_Mosciski, Ziemann and Farrell",shopping_net,1039.42,Travis,Daniel,M,1327 Rose Causeway Apt. 610,Senatobia,MS,38668,34.6323,-89.8855,14462,Database administrator,1959-03-03,25b076c7bcd70f272c1c5326bb234f4b,1387751508,34.628434,-90.284780,1
19300,2020-12-22 23:06:03,2242176657877538,fraud_Bauch-Raynor,grocery_pos,289.27,Travis,Daniel,M,1327 Rose Causeway Apt. 610,Senatobia,MS,38668,34.6323,-89.8855,14462,Database administrator,1959-03-03,2df7d894868fbc99ec1d8b055585fc9d,1387753563,34.746063,-90.401093,1
19301,2020-12-22 23:13:39,2242176657877538,fraud_Jaskolski-Vandervort,misc_net,766.38,Travis,Daniel,M,1327 Rose Causeway Apt. 610,Senatobia,MS,38668,34.6323,-89.8855,14462,Database administrator,1959-03-03,44292cbc51e37dc018ee6a988a4bc426,1387754019,33.771462,-90.651342,1

## 1) Top 5 cities where most fraudent transaction occur

In [23]:
a=df[df["is_fraud"]==1]

In [26]:
a.shape

(9651, 22)

In [25]:
a["city"].value_counts().head()

city
Houston          39
Dallas           39
Birmingham       36
New York City    35
Camden           34
Name: count, dtype: int64

## 2)Most frequent transaction categories associated with fraudulent transaction

In [27]:
a["category"].value_counts().head()

category
grocery_pos      2228
shopping_net     2219
misc_net         1182
shopping_pos     1056
gas_transport     772
Name: count, dtype: int64

## 3)Top 10 most frequent merchants for fraudulent transaction

In [28]:
a["merchant"].value_counts().head(10)

merchant
fraud_Kilback LLC                      62
fraud_Kozey-Boehm                      60
fraud_Rau and Sons                     60
fraud_Doyle Ltd                        57
fraud_Terry-Huel                       56
fraud_Boyer PLC                        55
fraud_Kuhn LLC                         55
fraud_Moen, Reinger and Murphy         53
fraud_Mosciski, Ziemann and Farrell    53
fraud_Kiehn-Emmerich                   53
Name: count, dtype: int64

## 4) Calculate average amount spent by each gender and visualize it

In [29]:
df.gender.unique()

array(['F', 'M'], dtype=object)

In [36]:
a=df[df["gender"]=="F"]
b=df[df["gender"]=="M"]
print("Average amount spend by female is",a.amt.mean())
print("Average amount spend by male is",b.amt.mean())

Average amount spend by female is 271.71298766157463
Average amount spend by male is 330.5072156215621

## 5) Top 5 merchants with the highest average transaction amount

In [47]:
a=df.sort_values(by="amt", ascending=False)

In [51]:
a[["merchant","amt"]].head()

                                  merchant      amt
5369    fraud_Streich, Dietrich and Barton  7508.46
2600                  fraud_Goyette-Herzog  4673.39
3568  fraud_Schroeder, Wolff and Hermiston  3304.44
8203      fraud_Hartmann, Rowe and Hermann  3066.61
2954     fraud_Larson, Quitzon and Spencer  2967.92

## 6)Calculate the age of each customers

In [55]:
a=df[["first","last","dob"]]
a

             first    last         dob
0            Tammy   Davis  1977-08-12
1           Monica  Tucker  1999-06-06
2            Scott  Martin  1967-08-02
3      Christopher  Grimes  1948-04-11
4         Mckenzie  Brooks  1961-12-14
...            ...     ...         ...
19297       Travis  Daniel  1959-03-03
19298       Travis  Daniel  1959-03-03
19299       Travis  Daniel  1959-03-03
19300       Travis  Daniel  1959-03-03
19301       Travis  Daniel  1959-03-03

[19302 rows x 3 columns]

In [56]:
a["year"] = a["dob"].str.split("-").str[0]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\4099330139.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["year"] = a["dob"].str.split("-").str[0]

             first    last         dob  year
0            Tammy   Davis  1977-08-12  1977
1           Monica  Tucker  1999-06-06  1999
2            Scott  Martin  1967-08-02  1967
3      Christopher  Grimes  1948-04-11  1948
4         Mckenzie  Brooks  1961-12-14  1961
...            ...     ...         ...   ...
19297       Travis  Daniel  1959-03-03  1959
19298       Travis  Daniel  1959-03-03  1959
19299       Travis  Daniel  1959-03-03  1959
19300       Travis  Daniel  1959-03-03  1959
19301       Travis  Daniel  1959-03-03  1959

[19302 rows x 4 columns]

In [61]:
a["age"] = 2025 - a["year"].astype(int)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\1388983106.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["age"] = 2025 - a["year"].astype(int)

In [62]:
# Age of each customer when taking the year of their birth
a

             first    last         dob  year  age
0            Tammy   Davis  1977-08-12  1977   48
1           Monica  Tucker  1999-06-06  1999   26
2            Scott  Martin  1967-08-02  1967   58
3      Christopher  Grimes  1948-04-11  1948   77
4         Mckenzie  Brooks  1961-12-14  1961   64
...            ...     ...         ...   ...  ...
19297       Travis  Daniel  1959-03-03  1959   66
19298       Travis  Daniel  1959-03-03  1959   66
19299       Travis  Daniel  1959-03-03  1959   66
19300       Travis  Daniel  1959-03-03  1959   66
19301       Travis  Daniel  1959-03-03  1959   66

[19302 rows x 5 columns]

## 7) Top 5 states with highest number of transactions

In [69]:
df["state"].value_counts().head()

state
NY    1290
TX    1287
PA    1153
CA     857
OH     687
Name: count, dtype: int64

## 8) Distribution of transaction over the course of month

In [75]:
a=df[["dob"]]
a["month"] = a["dob"].str.split("-").str[0]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\1803440968.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["month"] = a["dob"].str.split("-").str[1]

In [77]:
a["month"].value_counts()
#DISTRIBUTION FOR EACH MONTH

month
03    1804
05    1747
11    1675
04    1663
01    1646
06    1642
07    1631
09    1631
12    1569
10    1514
08    1505
02    1275
Name: count, dtype: int64

## 9) Visualize reln btw transaction date and fraud occurance over time

In [78]:
# SKIPPING DUE TO LIMITATION

## 10) Analyse spending pattern based on age groups and avg spending amount for each group

In [98]:
a=df[["dob","amt"]]

In [99]:
a

              dob      amt
0      1977-08-12    50.81
1      1999-06-06     1.97
2      1967-08-02   100.18
3      1948-04-11     7.67
4      1961-12-14   478.10
...           ...      ...
19297  1959-03-03  1041.51
19298  1959-03-03   868.09
19299  1959-03-03  1039.42
19300  1959-03-03   289.27
19301  1959-03-03   766.38

[19302 rows x 2 columns]

In [100]:
a["year"] = a["dob"].str.split("-").str[0]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\3980866657.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["year"] = a["dob"].str.split("-").str[0]

In [101]:
a["age"] = 2025 - a["year"].astype(int)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\1388983106.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["age"] = 2025 - a["year"].astype(int)

In [102]:
a

              dob      amt  year  age
0      1977-08-12    50.81  1977   48
1      1999-06-06     1.97  1999   26
2      1967-08-02   100.18  1967   58
3      1948-04-11     7.67  1948   77
4      1961-12-14   478.10  1961   64
...           ...      ...   ...  ...
19297  1959-03-03  1041.51  1959   66
19298  1959-03-03   868.09  1959   66
19299  1959-03-03  1039.42  1959   66
19300  1959-03-03   289.27  1959   66
19301  1959-03-03   766.38  1959   66

[19302 rows x 4 columns]

In [103]:

bins = [18, 25, 50, 100]  
labels = ["Young (18-25)", "Middle-aged (26-50)", "Senior (51+)"]


a["age_group"] = pd.cut(a["age"], bins=bins, labels=labels, right=False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\3914564035.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["age_group"] = pd.cut(a["age"], bins=bins, labels=labels, right=False)

In [106]:
each_avg= a.groupby("age_group")["amt"].mean()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\917758100.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  each_avg= a.groupby("age_group")["amt"].mean()

In [107]:
each_avg
#Average spending amount for each group

age_group
Young (18-25)          322.235019
Middle-aged (26-50)    272.959675
Senior (51+)           320.432807
Name: amt, dtype: float64

In [109]:
a.groupby("age_group")["amt"].agg(["sum", "mean", "count"])
# Spend pattern for each age group

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8424\2597938702.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  a.groupby("age_group")["amt"].agg(["sum", "mean", "count"])

                            sum        mean  count
age_group
Young (18-25)          84747.81  322.235019    263
Middle-aged (26-50)  2354823.12  272.959675   8627
Senior (51+)         3330258.16  320.432807  10393